<?php
// +----------------------------------------------------------------------
// | 模板设置
// +----------------------------------------------------------------------

return [
    // 模板引擎类型使用Think
    'type'             => 'Angular',
    'debug'            => true, // 是否开启调试模式
    'tpl_path'         => '', // 模板目录
    'tpl_suffix'       => '.html', // 模板后缀
    'tpl_cache_path'   => '', // 模板缓存目录
    'tpl_cache_suffix' => '.php', // 模板缓存文件后缀
    'directive_prefix' => 'php-', // 指令前缀
    'directive_max'    => 10000, // 指令的最大解析次数
];
